In [1]:
!pip install pandas

Requirement already satisfied: pandas in /usr/local/lib/python3.7/dist-packages (1.1.5)
Requirement already satisfied: numpy>=1.15.4 in /usr/local/lib/python3.7/dist-packages (from pandas) (1.19.5)
Requirement already satisfied: pytz>=2017.2 in /usr/local/lib/python3.7/dist-packages (from pandas) (2018.9)
Requirement already satisfied: python-dateutil>=2.7.3 in /usr/local/lib/python3.7/dist-packages (from pandas) (2.8.2)
Requirement already satisfied: six>=1.5 in /usr/local/lib/python3.7/dist-packages (from python-dateutil>=2.7.3->pandas) (1.15.0)

# Importando librerias

In [7]:
# Importamos librerias

import pandas as pd
import io
import os

from google.colab import files

## Cargando files

In [6]:
# Cargo archivos
uploaded = files.upload()

Saving titanic.csv to titanic.csv

In [9]:
df = pd.read_csv('titanic.csv', sep=',')
df.head()

   PassengerId  Survived  Pclass  ...     Fare Cabin  Embarked
0            1         0       3  ...   7.2500   NaN         S
1            2         1       1  ...  71.2833   C85         C
2            3         1       3  ...   7.9250   NaN         S
3            4         1       1  ...  53.1000  C123         S
4            5         0       3  ...   8.0500   NaN         S

[5 rows x 12 columns]

In [10]:
df.head()

   PassengerId  Survived  Pclass  ...     Fare Cabin  Embarked
0            1         0       3  ...   7.2500   NaN         S
1            2         1       1  ...  71.2833   C85         C
2            3         1       3  ...   7.9250   NaN         S
3            4         1       1  ...  53.1000  C123         S
4            5         0       3  ...   8.0500   NaN         S

[5 rows x 12 columns]

In [11]:
df.tail()

     PassengerId  Survived  Pclass  ...   Fare Cabin  Embarked
886          887         0       2  ...  13.00   NaN         S
887          888         1       1  ...  30.00   B42         S
888          889         0       3  ...  23.45   NaN         S
889          890         1       1  ...  30.00  C148         C
890          891         0       3  ...   7.75   NaN         Q

[5 rows x 12 columns]

In [13]:
df.shape

(891, 12)

In [14]:
df.describe()

       PassengerId    Survived      Pclass  ...       SibSp       Parch        Fare
count   891.000000  891.000000  891.000000  ...  891.000000  891.000000  891.000000
mean    446.000000    0.383838    2.308642  ...    0.523008    0.381594   32.204208
std     257.353842    0.486592    0.836071  ...    1.102743    0.806057   49.693429
min       1.000000    0.000000    1.000000  ...    0.000000    0.000000    0.000000
25%     223.500000    0.000000    2.000000  ...    0.000000    0.000000    7.910400
50%     446.000000    0.000000    3.000000  ...    0.000000    0.000000   14.454200
75%     668.500000    1.000000    3.000000  ...    1.000000    0.000000   31.000000
max     891.000000    1.000000    3.000000  ...    8.000000    6.000000  512.329200

[8 rows x 7 columns]

In [15]:
df.dtypes

PassengerId      int64
Survived         int64
Pclass           int64
Name            object
Sex             object
Age            float64
SibSp            int64
Parch            int64
Ticket          object
Fare           float64
Cabin           object
Embarked        object
dtype: object

In [16]:
df.columns

Index(['PassengerId', 'Survived', 'Pclass', 'Name', 'Sex', 'Age', 'SibSp',
       'Parch', 'Ticket', 'Fare', 'Cabin', 'Embarked'],
      dtype='object')

In [17]:
df[df['PassengerId']==148]

     PassengerId  Survived  Pclass  ...    Fare Cabin  Embarked
147          148         0       3  ...  34.375   NaN         S

[1 rows x 12 columns]

In [18]:
df[::2]

     PassengerId  Survived  Pclass  ...     Fare Cabin  Embarked
0              1         0       3  ...   7.2500   NaN         S
2              3         1       3  ...   7.9250   NaN         S
4              5         0       3  ...   8.0500   NaN         S
6              7         0       1  ...  51.8625   E46         S
8              9         1       3  ...  11.1333   NaN         S
..           ...       ...     ...  ...      ...   ...       ...
882          883         0       3  ...  10.5167   NaN         S
884          885         0       3  ...   7.0500   NaN         S
886          887         0       2  ...  13.0000   NaN         S
888          889         0       3  ...  23.4500   NaN         S
890          891         0       3  ...   7.7500   NaN         Q

[446 rows x 12 columns]

In [ ]:
# Mostrar por pantalla los nombres de las personas que iban en primera clase ordenadas alfabéticamente.

In [25]:
df['Pclass'].unique()

array([3, 1, 2])

In [26]:
cond = (df['Pclass'] == 1)

In [32]:
x = df[cond].sort_values(by='Name', ascending=True)

x['Name'].head()

730                      Allen, Miss. Elisabeth Walton
305                     Allison, Master. Hudson Trevor
297                       Allison, Miss. Helen Loraine
498    Allison, Mrs. Hudson J C (Bessie Waldo Daniels)
460                                Anderson, Mr. Harry
Name: Name, dtype: object

In [ ]:
# Añadir una nueva columna booleana para ver si el pasajero era menor de edad o no.

In [45]:
def mayor_menor_edad(edad):
  if edad >=18:
    return True
  if edad < 18 and edad >=0:
    return False
  else:
    return "DataNoExiste"

In [46]:
df['val_edad_bool'] = df.Age.apply(mayor_menor_edad)

df.head()

   PassengerId  Survived  Pclass  ... Cabin Embarked  val_edad_bool
0            1         0       3  ...   NaN        S           True
1            2         1       1  ...   C85        C           True
2            3         1       3  ...   NaN        S           True
3            4         1       1  ...  C123        S           True
4            5         0       3  ...   NaN        S           True

[5 rows x 13 columns]

In [36]:
lista_edades = [20 , 21 , 15]

In [38]:
for e in lista_edades:
  print(mayor_menor_edad(e))

True
True
False

In [47]:
df.Age.unique()

array([22.  , 38.  , 26.  , 35.  ,   nan, 54.  ,  2.  , 27.  , 14.  ,
        4.  , 58.  , 20.  , 39.  , 55.  , 31.  , 34.  , 15.  , 28.  ,
        8.  , 19.  , 40.  , 66.  , 42.  , 21.  , 18.  ,  3.  ,  7.  ,
       49.  , 29.  , 65.  , 28.5 ,  5.  , 11.  , 45.  , 17.  , 32.  ,
       16.  , 25.  ,  0.83, 30.  , 33.  , 23.  , 24.  , 46.  , 59.  ,
       71.  , 37.  , 47.  , 14.5 , 70.5 , 32.5 , 12.  ,  9.  , 36.5 ,
       51.  , 55.5 , 40.5 , 44.  ,  1.  , 61.  , 56.  , 50.  , 36.  ,
       45.5 , 20.5 , 62.  , 41.  , 52.  , 63.  , 23.5 ,  0.92, 43.  ,
       60.  , 10.  , 64.  , 13.  , 48.  ,  0.75, 53.  , 57.  , 80.  ,
       70.  , 24.5 ,  6.  ,  0.67, 30.5 ,  0.42, 34.5 , 74.  ])

In [48]:
df[df.Age.isna()]

     PassengerId  Survived  Pclass  ... Cabin Embarked  val_edad_bool
5              6         0       3  ...   NaN        Q   DataNoExiste
17            18         1       2  ...   NaN        S   DataNoExiste
19            20         1       3  ...   NaN        C   DataNoExiste
26            27         0       3  ...   NaN        C   DataNoExiste
28            29         1       3  ...   NaN        Q   DataNoExiste
..           ...       ...     ...  ...   ...      ...            ...
859          860         0       3  ...   NaN        C   DataNoExiste
863          864         0       3  ...   NaN        S   DataNoExiste
868          869         0       3  ...   NaN        S   DataNoExiste
878          879         0       3  ...   NaN        S   DataNoExiste
888          889         0       3  ...   NaN        S   DataNoExiste

[177 rows x 13 columns]

## Expotando data

In [40]:
df.to_excel('descarga.xlsx',sheet_name='nuevo',index=False)

In [41]:
files.download('descarga.xlsx')

In [5]:
!rm -rf *.csv # eliminar archivos